export default function About() {
  return (
    <div className="p-8 bg-white shadow-lg rounded-md max-w-[calc(42.9rem)] mx-auto my-8">
      <h1 className="text-3xl font-bold mb-4 text-slate-800">За Нас</h1>
      <p className="text-lg mb-4 text-slate-600">
        Добре дошли в нашата платформа за доставка на храна! Посветени сме на това да ви предоставим вкусни ястия директно до вашия праг с удобство и бързина.
      </p>
      <p className="text-lg mb-4 text-slate-600">
        Нашата мисия е проста: да ви свържем с разнообразни местни ресторанти, предлагащи разнообразие от кухни. Независимо дали имате желание за уютна храна, изследвате нови вкусове или търсите здравословни опции, ние сме тук за вас.
      </p>
      <p className="text-lg mb-4 text-slate-600">
        Открийте удоволствието от безпроблемното хранене. Разгледайте нашия обширен меню, направете своята поръчка и се отпуснете, докато се грижим за всичко останало. Вашето удовлетворение е наш приоритет, и се стремим да направим всяко хранене незабравимо.
      </p>
      <p className="text-lg mb-4 text-slate-600">
        Благодарим ви, че избрахте нашата услуга за доставка на храна. Насладете се на удобството, насладете се на вкусовете и нека се погрижим за вашите кулинарни желания!
      </p>
    </div>
  )
}